In [1]:
import sqlite3 as sql

In [5]:
conn = sql.connect('Chinook.db')

In [6]:
cursor = conn.cursor()

In [21]:
# this allows to select all columns with a limit of 5 records
cursor.execute('SELECT * FROM albums LIMIT 5')

In [25]:
# fetches all records
cursor.fetchall()

# fethcmany() has the default parameter value of 1
# cursor.fetchmany(5)

[]

In [24]:
cursor.execute('INSERT INTO artists(ArtistID, Name) values(276, "Kiyo")')

In [26]:
# commits the changes to the database
conn.commit()

In [41]:
albums = [(348,'Okay Lang Yan',276), 
          (349, 'Eba', 276), 
          (350, 'Nandito Na', 276),
          (351, 'Dantay', 276),
          (352, 'Ikaw Lang', 276)
         ]

In [42]:
cursor.executemany('INSERT INTO albums(AlbumID, Title, ArtistID) values(?, ?, ?)', albums)

In [43]:
conn.commit()

In [39]:
cursor.execute('DELETE FROM albums WHERE ArtistID=276')

In [40]:
conn.commit()

In [45]:
import pandas as pd

In [47]:
df_albums = pd.read_sql_query('SELECT * FROM albums', conn)

In [48]:
df_albums

     AlbumId                                  Title  ArtistId
0          1  For Those About To Rock We Salute You         1
1          2                      Balls to the Wall         2
2          3                      Restless and Wild         2
3          4                      Let There Be Rock         1
4          5                               Big Ones         3
..       ...                                    ...       ...
347      348                          Okay Lang Yan       276
348      349                                    Eba       276
349      350                             Nandito Na       276
350      351                                 Dantay       276
351      352                              Ikaw Lang       276

[352 rows x 3 columns]

In [49]:
df_albums.shape

(352, 3)

In [50]:
df_albums.to_csv('Albums.csv', index=False)